Revit 2024 API
MEPSize.InnerDiameter Property
 Inner diameter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public double InnerDiameter { get; }
Visual Basic
Public ReadOnly Property InnerDiameter As Double
	Get
Visual C++
public:
property double InnerDiameter {
	double get ();
}
See Also
MEPSize Class
Autodesk.Revit.DB Namespace